
interface accessoriesType {
  [key:string]: {
    [key:string]: string[]
  }
}

export const accessoriesBasicStatus:accessoriesType = {
  '목걸이': {
    // 스탯, 체력
    '고대': ['+12546', '체력 +3308'],
    '유물': ['+9872', '체력 +2848'],
    '전설': ['+2628', '체력 +1178'],
    '영웅': ['+2400', '체력 +1104'],
    '희귀': ['+189', '체력 +140'],
  },
  '귀걸이': {
    // 스탯, 체력
    '고대': ['+9758', '체력 +2363'],
    '유물': ['+7678', '체력 +2034'],
    '전설': ['+2044', '체력 +841'],
    '영웅': ['+1867', '체력 +789'],
    '희귀': ['+147', '체력 +100'],
  },
  '반지': {
    // 스탯, 체력
    '고대': ['+9061', '체력 +1890'],
    '유물': ['+7130', '체력 +1628'],
    '전설': ['+1898', '체력 +673'],
    '영웅': ['+1734', '체력 +631'],
    '희귀': ['+136', '체력 +80'],
  }
}
