type collectionAcquisitionMethodType = {
  [key:string]: string;
}

export const giantHeartList:collectionAcquisitionMethodType = {
  '첫 번째 거인의 심장': '[퀘스트] 토토이크 - 흩어진 다섯 형제',
  '두 번째 거인의 심장': '[호감도] 트리시온 - 베아트리스',
  '세 번째 거인의 심장': '[호감도] 슈테른 - 사샤',
  '네 번째 거인의 심장': '[필드 보스] 머무른 시간의 호수 - 타르실라',
  '다섯 번째 거인의 심장': '[물물교환] 검은이빨의 주둔지 - 항해사 로사',
  '여섯 번째 거인의 심장': '[물물교환] 해적마을 아틀라스 - 암거래 상인',
  '일곱 번째 거인의 심장': '[평판] 두키 섬 - 두키왕을 잡아라',
  '여덟 번째 거인의 심장': '[물물교환] 자유의 섬 - 검은이빨',
  '아홉 번째 거인의 심장': '[호감도] 히프노스의 눈 - 칼바서스',
  '열 번째 거인의 심장': '[타워] 타워 오브 쉐도우',
  '열한 번째 거인의 심장': '[평판] 푸른 바람의 섬 - 초원의 벌레',
  '열두 번째 거인의 심장': '[퀘스트] 그림자 달 시장 - 마음을 쥔 정령',
  '열세 번째 거인의 심장': '[타워] 타워 오브 페이트',
  '열네 번째 거인의 심장': '[호감도] 속삭이는 작은 섬 - 니나브',
  '열다섯 번째 거인의 심장': '[퀘스트] 지혜의 섬 - 열다섯 번째 심장',
}

export const starOfOrpheusList:collectionAcquisitionMethodType = {
  '오르페우스의 별 #1': '[퀘스트] 속삭이는 별',
  '오르페우스의 별 #2': '[평판] 니아 마을 - 정화 의식',
  '오르페우스의 별 #3': '[호감도] 니아 마을 - 니아',
  '오르페우스의 별 #4': '[물물교환] 파푸니카 - 작살아귀 헌팅 길드선',
  '오르페우스의 별 #5': '[필드 보스] 티카티카 군락지 - 모아케',
  '오르페우스의 별 #6': '[몬스터 처치] 탄식의 정원 - 망가진 스텔라',
  '오르페우스의 별 #7': '[던전] 베른 남부 - 혼돈의 사선',
  '오르페우스의 별 #8': '[필드 보스] 레갸르방크 대평원 - 헤르무트',
  '오르페우스의 별 #9': '[필드 보스] 엘가시아 - 이스라펠',
  '오르페우스의 별 #10': '[필드 보스] 볼다이크 - 드라커스',
}

export const greatArtworkList:collectionAcquisitionMethodType = {
  '위대한 미술품 #1': '[퀘스트] 해바라기 섬 - 그림자에 갇힌 예술가',
  '위대한 미술품 #2': '[원정대 영지] 무역 상인 - 일레인',
  '위대한 미술품 #3': '[수집품] 섬의 마음 보상',
  '위대한 미술품 #4': '[모험의 서] 루테란 동부',
  '위대한 미술품 #5': '[모험의 서] 토토이크',
  '위대한 미술품 #6': '[모험의 서] 애니츠',
  '위대한 미술품 #7': '[모험의 서] 베른 북부',
  '위대한 미술품 #8': '[모험의 서] 슈사이어',
  '위대한 미술품 #9': '[평판] 오즈혼 구릉지 - 저주받은 유적',
  '위대한 미술품 #10': '[평판] 갈기파도 항구 - 항구의 운영을 책임진다',
  '위대한 미술품 #11': '[수집품] 세계수의 잎 보상',
  '위대한 미술품 #12': '[물물교환] 검은 이빨 주둔지 - 항해사 로사',
  '위대한 미술품 #13': '[퀘스트] 아픈 만큼 성숙해진다',
  '위대한 미술품 #14': '[에브니 큐브]',
  '위대한 미술품 #15': '[에브니 큐브]',
  '위대한 미술품 #16': '[비밀던전]',
  '위대한 미술품 #17': '[타워]',
  '위대한 미술품 #18': '[평판] 칼트헤르츠 - 노예 해방',
  '위대한 미술품 #19': '[평판] 자유의 섬 - 고고학자의 부탁',
  '위대한 미술품 #20': '[물물교환] 별빛 등대의 섬 - 프랭크',
  '위대한 미술품 #21': '[수집품] 거인의 심장 보상',
  '위대한 미술품 #22': '[수집품] 섬의 마음 보상',
  '위대한 미술품 #23': '[수집품] 항해 모험물 보상',
  '위대한 미술품 #24': '[에브니 큐브]',
  '위대한 미술품 #25': '[에브니 큐브]',
  '위대한 미술품 #26': '[비밀던전]',
  '위대한 미술품 #27': '[물물교환] - 베른 신형 탐사선',
  '위대한 미술품 #28': '[평판] 페르마타 - 페르마타의 진정한 매니저',
  '위대한 미술품 #29': '[호감도] 히프노스의 눈 - 푸른 눈의 칼바서스',
  '위대한 미술품 #30': '[모험의 서] 로헨델',
  '위대한 미술품 #31': '[모험의 서] 욘',
  '위대한 미술품 #32': '[수집품] 모코코 씨앗 보상',
  '위대한 미술품 #33': '[수집품] 거인의 심장 보상',
  '위대한 미술품 #34': '[물물교환] 아트로포스 - 검은 상인 교환',
  '위대한 미술품 #35': '[에브니 큐브]',
  '위대한 미술품 #36': '[에브니 큐브]',
  '위대한 미술품 #37': '[모험의 서] 페이튼',
  '위대한 미술품 #38': '[수집품] 섬의 마음 보상',
  '위대한 미술품 #39': '[수집품] 항해 모험물 보상',
  '위대한 미술품 #40': '[에브니 큐브]',
  '위대한 미술품 #41': '[에브니 큐브]',
  '위대한 미술품 #42': '[비밀던전]',
  '위대한 미술품 #43': '[모험의 서] 파푸니카',
  '위대한 미술품 #44': '[수집품] 모코코 씨앗',
  '위대한 미술품 #45': '[에브니 큐브]',
  '위대한 미술품 #46': '[에브니 큐브]',
  '위대한 미술품 #47': '[비밀던전]',
  '위대한 미술품 #48': '[평판] 별모래 해변 - 노곤노곤 온천 아르바이트',
  '위대한 미술품 #49': '[모험의 서] 베른 남부',
  '위대한 미술품 #50': '[평판] 아빠와 딸의 여행',
  '위대한 미술품 #51': '[비밀던전]',
  '위대한 미술품 #52': '[호감도] 베른 남부 - 네리아',
  '위대한 미술품 #53': '[에브니 큐브]',
  '위대한 미술품 #54': '[에브니 큐브]',
  '위대한 미술품 #55': '[타워] 타워 오브 데스티니',
  '위대한 미술품 #56': '[모험의 서] 로웬',
  '위대한 미술품 #57': '[평판] 지상에서 온 별',
  '위대한 미술품 #58': '[타워] 타워 오브 데스티니',
  '위대한 미술품 #59': '[에브니 큐브]',
  '위대한 미술품 #60': '[평판] 플레체 - 베디체 재단'
}

export const musicBoxOfMemoryList:collectionAcquisitionMethodType = {
  '기억의 구슬 #1': '[퀘스트] 배꽃나무 자생지 - 검은 들녘 바깥의 삶',
  '기억의 구슬 #2': '[퀘스트] 은빛물결 호수 - 너를 위한 자장가',
  '기억의 구슬 #3': '[퀘스트] 라니아 마을 - 레기오로스의 수염이라고!',
  '기억의 구슬 #4': '[퀘스트] 티카티카 군락지 - 새로운 나를 위한 것이었음을',
  '기억의 구슬 #5': '[퀘스트] 디오리카 평원 - 할아버지와 손자',
  '기억의 구슬 #6': '[퀘스트] 니아 마을 - 전설이 시작된 곳',
  '기억의 구슬 #7': '[퀘스트] 레온하트 - 그들의 유토피아?',
  '기억의 구슬 #8': '[퀘스트] 라니아 마을 - 즐거운 나의 집',
  '기억의 구슬 #9': '[퀘스트] 머무른 시간의 호수 - 가깝고도 먼 사이',
  '기억의 구슬 #10': '[퀘스트] 이름 없는 협곡 - 영웅을 기억하는 법',
  '기억의 구슬 #11': '[퀘스트] 은빛물결 호수 - 멀리 온 소풍',
  '기억의 구슬 #12': '[퀘스트] 크로커니스 해변 - 마음이 도착하는 곳',
  '기억의 구슬 #13': '[퀘스트] 이름 없는 협곡 - 돌이킬 수 없는 꿈',
  '기억의 구슬 #14': '[퀘스트] 거북 섬 - 모래 톱에 부서지는 윤슬처럼',
  '기억의 구슬 #15': '[퀘스트] 살란드 구릉지 - 전설이 영웅에게',
  '기억의 구슬 #16': '[퀘스트] 소리의 숲 - 화불재양, 돌아갈 수 없더라도'
}

export const igneaMarkList:collectionAcquisitionMethodType = {
  '이그네아의 징표 :아르테미스': '[모험의 서]아르테미스',
  '이그네아의 징표 :유디아': '[모험의 서]유디아',
  '이그네아의 징표 :루테란 서부': '[모험의 서]루테란 서부',
  '이그네아의 징표 :루테란 동부': '[모험의 서]루테란 동부',
  '이그네아의 징표 :토토이크': '[모험의 서]토토이크',
  '이그네아의 징표 :애니츠': '[모험의 서]애니츠',
  '이그네아의 징표 :아르데타인': '[모험의 서]아르데타인',
  '이그네아의 징표 :베른 북부': '[모험의 서]베른 북부',
  '이그네아의 징표 :슈샤이어': '[모험의 서]슈샤이어',
  '이그네아의 징표 :로헨델': '[모험의 서]로헨델',
  '이그네아의 징표 :욘': '[모험의 서]욘',
  '이그네아의 징표 :페이튼': '[모험의 서]페이튼',
  '이그네아의 징표 :파푸니카': '[모험의 서]파푸니카',
  '이그네아의 징표 :베른 남부': '[모험의 서]베른 남부',
  '이그네아의 징표 :로웬': '[모험의 서]로웬',
  '이그네아의 징표 :엘가시아': '[모험의 서]엘가시아',
  '이그네아의 징표 :볼다이크': '[모험의 서]볼다이크',
  '이그네아의 징표 :쿠르잔 남부': '[모험의 서]쿠르잔 남부'
}

export const leavesOfTheWorldTree:collectionAcquisitionMethodType = {
  '세계수의 잎 #1': '[가이드] 즐거운 생활 수집품 모으기',
  '세계수의 잎 #2': '[생활] 채집',
  '세계수의 잎 #3': '[생활] 벌목',
  '세계수의 잎 #4': '[생활] 채광',
  '세계수의 잎 #5': '[생활] 수렵',
  '세계수의 잎 #6': '[생활] 낚시',
  '세계수의 잎 #7': '[생활] 고고학',
  '세계수의 잎 #8': '[생활] 채집',
  '세계수의 잎 #9': '[생활] 벌목',
  '세계수의 잎 #10': '[생활] 채광',
  '세계수의 잎 #11': '[생활] 수렵',
  '세계수의 잎 #12': '[생활] 낚시',
  '세계수의 잎 #13': '[생활] 고고학',
  '세계수의 잎 #14': '[생활] 채집',
  '세계수의 잎 #15': '[생활] 벌목',
  '세계수의 잎 #16': '[생활] 채광',
  '세계수의 잎 #17': '[생활] 수렵',
  '세계수의 잎 #18': '[생활] 낚시',
  '세계수의 잎 #19': '[생활] 고고학',
  '세계수의 잎 #20': '[생활] 채집',
  '세계수의 잎 #21': '[생활] 벌목',
  '세계수의 잎 #22': '[생활] 채광',
  '세계수의 잎 #23': '[생활] 수렵',
  '세계수의 잎 #24': '[생활] 낚시',
  '세계수의 잎 #25': '[생활] 고고학',
  '세계수의 잎 #26': '[생활] 채집',
  '세계수의 잎 #27': '[생활] 벌목',
  '세계수의 잎 #28': '[생활] 채광',
  '세계수의 잎 #29': '[생활] 수렵',
  '세계수의 잎 #30': '[생활] 낚시',
  '세계수의 잎 #31': '[생활] 고고학',
  '세계수의 잎 #41': '[생활] 채집',
  '세계수의 잎 #42': '[생활] 벌목',
  '세계수의 잎 #43': '[생활] 채광',
  '세계수의 잎 #44': '[생활] 수렵',
  '세계수의 잎 #45': '[생활] 낚시',
  '세계수의 잎 #46': '[생활] 고고학',
  '세계수의 잎 #50': '[생활] 채집',
  '세계수의 잎 #51': '[생활] 벌목',
  '세계수의 잎 #52': '[생활] 채광',
  '세계수의 잎 #53': '[생활] 수렵',
  '세계수의 잎 #54': '[생활] 낚시',
  '세계수의 잎 #55': '[생활] 고고학',
  '세계수의 잎 #59': '[생활] 채집',
  '세계수의 잎 #60': '[생활] 벌목',
  '세계수의 잎 #61': '[생활] 채광',
  '세계수의 잎 #62': '[생활] 수렵',
  '세계수의 잎 #63': '[생활] 낚시',
  '세계수의 잎 #64': '[생활] 고고학',
  '세계수의 잎 #68': '[생활] 채집',
  '세계수의 잎 #69': '[생활] 벌목',
  '세계수의 잎 #70': '[생활] 채광',
  '세계수의 잎 #71': '[생활] 수렵',
  '세계수의 잎 #72': '[생활] 낚시',
  '세계수의 잎 #73': '[생활] 고고학',
  '세계수의 잎 #74': '[생활] 식물채집 - 비밀의 열대 식물',
  '세계수의 잎 #75': '[사용] 비밀 주머니 : 부드러운 주머니',
  '세계수의 잎 #76': '[사용] 비밀 주머니 : 빛나는 백금 주머니',
  '세계수의 잎 #77': '[생활] 채집',
  '세계수의 잎 #78': '[생활] 벌목',
  '세계수의 잎 #79': '[생활] 채광',
  '세계수의 잎 #80': '[생활] 수렵',
  '세계수의 잎 #81': '[생활] 낚시',
  '세계수의 잎 #82': '[생활] 고고학',
  '세계수의 잎 #83': '[사용] 비밀 주머니 : 질긴 가죽 주머니',
  '세계수의 잎 #84': '[사용] 비밀 주머니 : 신기한 마법 주머니',
  '세계수의 잎 #85': '[사용] 비밀 주머니 : 보석 장식 주머니',
  '세계수의 잎 #86': '[생활] 채집',
  '세계수의 잎 #87': '[생활] 벌목',
  '세계수의 잎 #88': '[생활] 채광',
  '세계수의 잎 #89': '[생활] 수렵',
  '세계수의 잎 #90': '[생활] 낚시',
  '세계수의 잎 #91': '[생활] 고고학',
  '세계수의 잎 #92': '[생활] 채집',
  '세계수의 잎 #93': '[생활] 벌목',
  '세계수의 잎 #94': '[생활] 채광',
  '세계수의 잎 #95': '[생활] 수렵',
  '세계수의 잎 #96': '[생활] 낚시',
  '세계수의 잎 #97': '[생활] 고고학',
  '세계수의 잎 #98': '[사용] 비밀 주머니 : 향기 나는 주머니',
  '세계수의 잎 #99': '[생활] 벌목 - 깨어난 비밀의 나무',
  '세계수의 잎 #100': '[사용] 비밀 주머니 : 반짝이는 주머니',
  '세계수의 잎 #101': '[생활] 채집',
  '세계수의 잎 #102': '[생활] 벌목',
  '세계수의 잎 #103': '[생활] 채광',
  '세계수의 잎 #104': '[생활] 수렵',
  '세계수의 잎 #105': '[생활] 낚시',
  '세계수의 잎 #106': '[생활] 고고학',
  '세계수의 잎 #107': '[사용] 비밀 주머니 : 마력이 스민 주머니',
  '세계수의 잎 #108': '[사용] 무지개 물고기',
  '세계수의 잎 #109': '[사용] 다시 피어난 꽃망울',
  '세계수의 잎 #110': '',
  '세계수의 잎 #111': '',
  '세계수의 잎 #112': '',
  '세계수의 잎 #113': '',
  '세계수의 잎 #114': '',
  '세계수의 잎 #115': '',
  '세계수의 잎 #116': '',
  '세계수의 잎 #117': '',
  '세계수의 잎 #118': '',
}


// 1. 모험물 : 모코코 버섯 : [모험의 서] 토토이크 
// 10. 모험물 : 오색앵무새 : [모험의 서] 로헨델 
// 11. 모험물 : 바람의 석판 : [원정대 영지] 프라우케 - 승리의 인장 교환 (승리의 인장 11400개)
// 12. 모험물 : 반달 가면 : [페이튼] 칼리자 마을 - 비올레 (호감도: 신뢰 달성)
// 13. 모험물 : 고대 지팡이 : [파푸니카] 니아 마을 - 자하라 (호감도: 신뢰 달성)
// 14. 모험물 : 고대 금화 : [파푸니카] 니아 마을 - 리루 (호감도: 신뢰 달성)
// 15. 모험물 : 잊혀진 호수 : [루테란 서부] 레이크바 - 장인 우르르 (호감도: 신뢰 달성)
// 16. 모험물 : 크래바스 : [대항해] 부서진 빙하의 섬 - 샐리 (호감도: 신뢰 달성)
// 17. 모험물 : 불타는 얼음 : [페이튼] 이름 없는 협곡 - 페데리코 (호감도: 신뢰 달성)
// 18. 모험물 : 고인돌 : [물물교환] 욘 항구 작살아귀 헌팅 길드선 (아크투르스 주화 3340개)
// 19. 모험물 : 마법진 : [대항해] 희망의 섬 - 네스 (호감도: 신뢰 달성)
// 2. 모험물 : 라마 : [원정대 영지] 덕현 - 모험의 인장 교환 (모험의 인장 12000개)
// 20. 모험물 : 난파선 잔해 : [물물교환] 아르데타인항구 작살아귀 헌팅 길드선 (기에나 주화 3340개)
// 21. 모험물 : 참돌고래 : [물물교환] 베른 북부 항구 작살아귀 헌팅 길드선 (기에나 주화 6680개)
// 22. 모험물 : 극지 맘모스 : [모험의 서] 슈사이어 
// 23. 모험물 : 붉은낙타 : [모험의 서] 아르데타인 
// 24. 모험물 : 유니콘 : [대항해] 해상 낙원 페이토 - 타냐벤텀 (호감도: 신뢰 달성)
// 25. 모험물 : 유령 가오리 : [대항해] 난파선
// 26. 모험물 : 세이렌 : [대항해] 난파선 
// 27. 모험물 : 달의 탑 : [몬스터처치] 치킹 - [대항해] 알라케르 섬
// 28. 모험물 : 신의 창 : [물물교환] 루테란 항구 작살아귀 헌팅 길드선 (기에나 주화 3340개)
// 29. 모험물 : 기에나 석상 : [가이드] 대항해 - 모험물
// 3. 모험물 : 붉은바다거북 : [모험의 서] 파푸니카 
// 30. 모험물 : 오로라 : [대항해] 난파선 
// 31. 모험물 : 소용돌이 : [물물교환] 애니츠 항구 작살아귀 헌팅 길드선 (기에나 주화 3340개)
// 32. 모험물 : 침묵하는 섬 : [모험의 서] 페이튼 
// 33. 모험물 : 토토이끼 배 : [대항해] 난파선
// 34. 모험물 : 북해의 눈 : [물물교환] 슈사이어 항구 작살아귀 헌팅 길드선 (기에나 주화 6680개)
// 35. 모험물 : 남해의 눈 : [대항해] 환각의 섬 - 전리품
// 36. 모험물 : 죽은자의 눈 : [몬스터처치] 수신 아포라스 - [대항해] 죽음의 협곡 섬
// 37. 모험물 : 의문의 상자 : [몬스터처치] 바투아크 진 - [대항해] 포르페 섬
// 38. 모험물 : 해적의 의족 : [일반보상] 잠자는 노래의 섬
// 39. 모험물 : 해적의 깃발 : [몬스터처치] 고르카 그로스 - [대항해] 스피다 섬 
// 4. 모험물 : 스타더스트 : [원정대 영지] 아스티엘 - 승리의 인장 교환 (승리의 인장 11400개)
// 40. 모험물 : 헤스티아호 : [몬스터처치] 솔 그랑데 - [대항해] 알트아이젠 섬 
// 41. 모험물 : 환영 나비 : [몬스터처치] 아드린느 - [대항해] 환영 나비 섬
// 42. 모험물 : 대왕 조개 :  [수집품] 섬의 마음 보상 (섬의 마음 60개)
// 43. 모험물 : 천 덮인 선수상 : [몬스터처치] 티파니 - [욘] 무쇠망치 작업장
// 44. 모험물 : 여인의 얼음 조각상 : [수집품] 섬의 마음 보상 (섬의 마음 85개)
// 45. 모험물 : 눈썰매 : [모험의 서] 베른 남부 
// 46. 모험물 : 잃어버린 상선 : [평판] 베른 마법학회 (에포나 의뢰 평판보상)
// 47. 모험물 : 심해 암석 : [베른 남부] 벨리온 유적지 - 라하르트 (호감도: 신뢰 달성) 
// 5. 모험물 : 바다꽃 : [모험의 서] 애니츠 
// 6 모험물 : 스타후르츠 : [원정대 영지] 투루 - 모험의 인장 교환 (모험의 인장 11400개)
// 7. 모험물 : 용과 : [모험의 서] 욘 
// 8. 모험물 : 맨드릴 :  [원정대 영지] 플로르 - 승리의 인장 교환 (승리의 인장 10800개)
// 9. 모험물 : 유령 도마뱀 : [원정대 영지] 사하 - 토벌의 인장 교환 (토벌의 인장 10800개)
