type transcendanceDescriptType = {
  [key:string]: string[]
}

export const transcendanceDescript:transcendanceDescriptType = {
  '투구': [
    '장착중인 모든 장비의 초월 등급 당 최대 생명력이 80씩, 자신의 공격력에 기반한 파티 공격력 버프 효과가 0.01%씩 증가합니다.',
    '장착중인 모든 장비의 초월 등급 당 힘, 민첩, 지능이 55씩, 자신의 공격력에 기반한 파티 공격력 버프 효과가 0.01%씩 증가합니다.',
    '장착중인 모든 장비의 초월 등급 당 무기 공격력이 14씩, 자신의 공격력에 기반한 파티 공격력 버프 효과가 0.01%씩 증가합니다.',
    '장착중인 모든 장비의 초월 등급 당 공격력이 6씩, 자신의 공격력에 기반한 파티 공격력 버프 효과가 0.01%씩 증가합니다.'
  ],
  '어깨': [
    '무기 공격력이 1200 증가하며, 자신의 공격력에 기반한 파티 공격력 버프 효과가 1% 증가합니다.',
    '마법 방어력이 1800 증가합니다.',
    '무기 공격력이 1200 추가로 증가하며, 자신의 공격력에 기반한 파티 공격력 버프 효과가 1% 추가로 증가합니다.',
    '무기 공격력이 1200 추가로 증가하며, 자신의 공격력에 기반한 파티 공격력 버프 효과가 1% 추가로 증가합니다.'
  ],
  '상의': [
    `공격 적중 시 10초간 '전승자' 효과를 얻습니다. '전승자' 효과는 30초에 1회만 발동할 수 있습니다.
    '전승자\': 무기 공격력이 4800 추가로 증가한다.`,
    '체력이 1400 증가합니다.',
    `'전승자' 효과의 지속시간이 18초로 증가하며, 무기 공격력 증가량이 7200으로 적용됩니다.`,
    `공격 적중 시 '전승자' 효과의 지속시간이 6초 증가합니다. 해당 효과는 3초에 1회만 발동하며, 기본 지속시간 이상으로 증가하지 않습니다.`
  ],
  '하의': [
    '받는 피해가 3% 감소합니다.',
    `보스 등급 이상 몬스터에게 공격 적중 시 '전승자의 힘'이 발동합니다. '전승자의 힘' 효과는 30초에 1회만 발동하며, 고정된 피해를 입힙니다.
    자신의 공격력에 기반한 파티 공격력 버프 적용 시 '기원' 효과가 추가로 5초간 적용됩니다. 단, 지속시간이 4초 미만인 버프에는 2초간 적용됩니다.
    '기원' : 적에게 주는 피해 1.5% 증가`,
    `'전승자의 힘' 피해량이 2배로 증가하며, '기원'의 효과가 2.5%로 증가합니다.`,
    `'전승자의 힘'에 피해를 입은 적에게 1분 간 '위압감'을 부여합니다. 자신 및 파티원에게 '위압감'을 3회 부여받은 적은 모든 '위압감' 중첩을 잃고 40초 간 '위압'을 부여받습니다.
    위압 : 자신 및 파티원이 대상에게 주는 피해가 3% 증가
    '기원'의 효과가 3.5%로 증가하며, 지속시간이 10초로 증가합니다. 단, 지속시간이 4초 미만인 버프에는 4초간 적용됩니다.`
  ],
  '장갑': [
    '힘, 민첩, 지능이 4200 증가하며, 자신의 공격력에 기반한 파티 공격력 버프 효과가 1% 증가합니다.',
    '물리 방어력이 1800 증가합니다.',
    '힘, 민첩, 지능이 4200 추가로 증가하며, 자신의 공격력에 기반한 파티 공격력 버프 효과가 1% 추가로 증가합니다.',
    '힘, 민첩, 지능이 4200 추가로 증가하며, 자신의 공격력에 기반한 파티 공격력 버프 효과가 1% 추가로 증가합니다.'
  ],
}
